app/controllers/subjects_controller.rb

  def new
    @subject = Subject.new({:name => "Default"})
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM `subjects`

  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(subject_params)
    # Save the object
    if @subject.save
      # If save succeeds, redirect to the index action
      flash[:notice] = "Subject created successfully."
      redirect_to(:action => 'index')
    else
      # If save fails, redisplay the form so user can fix problems
      @subject_count = Subject.count + 1
---
INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Default', 1, 1, '2015-03-12 03:00:31.057743', '2015-03-12 03:00:31.057743')
SELECT COUNT(*) FROM `subjects`

  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 3 LIMIT 1
SELECT COUNT(*) FROM `subjects`

  def update
    # Find an existing object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(subject_params)
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 3 LIMIT 1
UPDATE `subjects` SET `name` = 'WhatThe', `position` = 1, `visible` = 0, `updated_at` = '2015-03-17 03:09:32.459928' WHERE `subjects`.`id` = 3